{
  "potential_projects": [
    {
      "url": "https://www.eqmagpro.com/framework-of-indias-climate-finance-taxonomy-eq/",
      "title": "Framework of India’s Climate Finance Taxonomy – EQ – The Leading Solar Magazine In India",
      "content_snippet": "Framework of India’s Climate Finance Taxonomy – EQ\n0\n0\nFramework of India’s Climate Finance Taxonomy\nFor more information please see below link:\nRelated posts:\n- India’s Climate Finance Taxonomy: The Green Rulebook – EQ\n- Statement by Mr. Kushagra Nandan, Co-Founder and MD, SunSource Energy on Government of India’s notification of Electricity (Promotion of Renewable Energy through Green Open Access) Rules 2022 – EQ Mag Pro\n- India’s Green Energy & Climate Leaders of Tomorrow Top 50 Under 50 in 2",
      "scores": {},
      "reason": "Not_Pipeline_Project",
      "timestamp": "2025-05-19T06:47:37.843571"
    },
    {
      "url": "https://www.eqmagpro.com/indias-climate-finance-taxonomy-the-green-rulebook-eq/",
      "title": "India’s Climate Finance Taxonomy: The Green Rulebook – EQ",
      "content_snippet": "The Ministry of Finance has released the Draft Framework of India’s #Climate #Finance #Taxonomy, and for anyone working in sustainability, finance, policy, infrastructure or #ESG, this is a document that demands your attention.\n\nWhat is it?\n\nThe Climate Finance Taxonomy is India’s first official classification system to define what qualifies as a “climate-aligned” activity or investment. It aims to bring clarity, prevent greenwashing, and ensure that climate finance flows into projects that actu",
      "scores": {
        "Solar": 0.0,
        "Battery": 0.0,
        "Wind": 0.0,
        "Hydro": 1.0,
        "GreenHydrogen": 2.0,
        "Biogas": 0.0,
        "Ethanol": 0.0
      },
      "reason": "Not_Renewable_Energy_Project",
      "timestamp": "2025-05-19T06:47:39.518691"
    },
    {
      "url": "https://indianexpress.com/article/business/imf-pakistan-india-11-new-benchmarks-loan-10013976/",
      "title": "IMF cites ‘enterprise risks’ for Pakistan amid tensions with India; lists 11 new structural benchmarks to avail loan",
      "content_snippet": "As part of its nod for two loan tranches worth $2.4 billion on May 9 for Pakistan, the International Monetary Fund (IMF) has introduced 11 new structural benchmarks, including parliamentary approval of budget in line with the loan facility, publishing a governance action plan, and notifications of electricity tariff rebasing and gas tariff adjustments, to be met by the country before its next review of the Extended Fund Facility (EFF) in September.\n\nIn a staff country report issued on May 17, th",
      "scores": {
        "Solar": 0.0,
        "Battery": 0.0,
        "Wind": 0.0,
        "Hydro": 0.0,
        "GreenHydrogen": 0.0,
        "Biogas": 0.0,
        "Ethanol": 0.0
      },
      "reason": "Not_Renewable_Energy_Project",
      "timestamp": "2025-05-19T06:47:48.609617"
    },
    {
      "url": "https://indianexpress.com/article/business/india-bangladesh-trade-ties-fraying-china-gaining-10013885/",
      "title": "How India–Bangladesh trade ties are fraying — and China gaining ground?",
      "content_snippet": "With Bangladesh set to graduate from the United Nations’ Least Developed Country (LDC) category in November 2026 — a move that will end its duty-free access to export markets such as the European Union, posing fresh challenges — the country has begun a sharp economic pivot away from New Delhi towards Beijing, thereby straining trade ties with India.\n\nPolitical and economic tensions between India and its largest trade partner in South Asia are growing, as the union government on Saturday decided ",
      "scores": {
        "Solar": 0.0,
        "Battery": 0.0,
        "Wind": 0.0,
        "Hydro": 0.0,
        "GreenHydrogen": 0.0,
        "Biogas": 0.0,
        "Ethanol": 0.0
      },
      "reason": "Not_Renewable_Energy_Project",
      "timestamp": "2025-05-19T06:47:49.122642"
    },
    {
      "url": "https://indianexpress.com/article/business/indian-airstrikes-pakistan-rahim-yar-khan-airbase-runway-closure-10013889/",
      "title": "In need of extensive repairs after Indian airstrikes, Pakistan’s Rahim Yar Khan airbase runway closure extended till June 6",
      "content_snippet": "This satellite image provided by Maxar Technologies shows building and other damage at Rahim Yar Khan in Southern Punjab, Pakistan, on May 10, 2025. (Maxar Technologies via AP)\n\nPakistan has extended the closure of the sole runway at its Rahim Yar Khan airbase—hit and damaged by India’s military strikes last Saturday (May 10)—till the morning of June 6. On the day of the airstrike, the Pakistan Civil Aviation Authority had issued a notice to airmen, or NOTAM, saying that the runway at the airbas",
      "scores": {
        "Solar": 0.0,
        "Battery": 0.0,
        "Wind": 0.0,
        "Hydro": 1.0,
        "GreenHydrogen": 0.0,
        "Biogas": 0.0,
        "Ethanol": 0.0
      },
      "reason": "Not_Renewable_Energy_Project",
      "timestamp": "2025-05-19T06:47:49.781891"
    },
    {
      "url": "https://indianexpress.com/article/business/donald-trump-tariffs-proposition-india-china-10013473/",
      "title": "Check your mailbox: Trump’s new tariff proposition, as India & China try to wrap up deals",
      "content_snippet": "On Maharashtra visit, CJI Gavai miffed over absence of top officials at event\n\n48 min ago\n\nOn his first visit to his home state of Maharashtra after taking over as Chief Justice of India on May 14, CJI B R Gavai expressed his disappointment at the absence of senior state officials at a felicitation event held in his honour Sunday, saying “every organ of the Constitution must...give its due respect to the other”. Speaking at the event in Mumbai, organised by the Bar Council of Maharashtra and Goa",
      "scores": {},
      "reason": "Not_Pipeline_Project",
      "timestamp": "2025-05-19T06:47:50.363081"
    },
    {
      "url": "https://indianexpress.com/article/business/inside-election-time-govt-social-media-cell-war-room-post-operation-sindoor-10013457/",
      "title": "Inside an election time govt social media cell that was converted to a 24/7 war room post Op Sindoor",
      "content_snippet": "On Maharashtra visit, CJI Gavai miffed over absence of top officials at event\n\n53 min ago\n\nOn his first visit to his home state of Maharashtra after taking over as Chief Justice of India on May 14, CJI B R Gavai expressed his disappointment at the absence of senior state officials at a felicitation event held in his honour Sunday, saying “every organ of the Constitution must...give its due respect to the other”. Speaking at the event in Mumbai, organised by the Bar Council of Maharashtra and Goa",
      "scores": {},
      "reason": "Not_Pipeline_Project",
      "timestamp": "2025-05-19T06:47:50.936098"
    },
    {
      "url": "https://indianexpress.com/article/business/china-curbs-on-rare-earth-magnets-electric-vehicle-makers-face-shortage-approach-govt-10013100/",
      "title": "China curbs on rare earth magnets: Electric Vehicle makers face shortage, approach govt",
      "content_snippet": "New restrictions on rare earth magnets and related materials imposed by China, as a direct response to US imposing tariffs that kicked in from April 4, are beginning to impact automakers across the world, including electric vehicle manufacturers in India.\n\nEV makers here are staring at a potential shortage of the critical components, which raises concerns of price hikes and production delays in a nascent, cost-sensitive segment of the auto market.\n\nThe Indian car industry is learnt to have initi",
      "scores": {
        "Solar": 0.0,
        "Battery": 0.0,
        "Wind": 0.0,
        "Hydro": 0.0,
        "GreenHydrogen": 0.0,
        "Biogas": 0.0,
        "Ethanol": 0.0
      },
      "reason": "Not_Renewable_Energy_Project",
      "timestamp": "2025-05-19T06:47:51.520649"
    },
    {
      "url": "https://indianexpress.com/article/business/moodys-downgrades-us-what-it-means-for-worlds-largest-economy-10012803/",
      "title": "Moody’s downgrades US: What it means for the world’s largest economy",
      "content_snippet": "Nearly four months after Donald Trump assumed charge as the President of the US, Moody’s Ratings on Friday downgraded the US government’s rating by one notch, reflecting the increase over more than a decade in government debt and interest payment ratios to levels that are significantly higher than similarly rated sovereigns.\n\nThe global rating firm slashed the long-term issuer and senior unsecured ratings of the US to Aa1 from Aaa and changed the outlook to stable from negative.\n\nMoody’s said su",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T06:47:52.156682"
    },
    {
      "url": "https://indianexpress.com/article/business/correction-frontline-indices-valuations-more-reasonable-axis-amc-10012913/",
      "title": "‘The 15-25% correction in frontline indices during October-February rendered valuations more reasonable’: Axis AMC MD Gopkumar",
      "content_snippet": "B Gopkumar, managing director and chief executive officer of Axis Asset Management Company, says that the 15-25 per cent correction in frontline indices between October 2024 and February 2025 has made domestic market valuations more ‘reasonable’. In an interview with Hitesh Vyas, Gopkumar, who manages assets worth Rs 3.32 lakh crore, says that at a growth rate of 6-6.5 per cent, India remains the fastest-growing economy among major global economies. He expects private capex to pick up from the s",
      "scores": {
        "Solar": 0.0,
        "Battery": 0.0,
        "Wind": 0.0,
        "Hydro": 0.0,
        "GreenHydrogen": 0.0,
        "Biogas": 0.0,
        "Ethanol": 0.0
      },
      "reason": "Not_Renewable_Energy_Project",
      "timestamp": "2025-05-19T06:47:52.731391"
    },
    {
      "url": "https://mercomindia.com/daily-news-wrap-up-intervention-needed-as-dcr-module-shortage-slows-pm-surya-ghar",
      "title": "Daily News Wrap-Up: Intervention Needed as DCR Module Shortage Slows PM Surya Ghar",
      "content_snippet": "When the PM Surya Ghar Muft Bijli Yojana was launched, it carried a bold promise. The goal was to help 10 million Indian households become prosumers through rooftop solar systems by March 2027. However, over a year into its rollout, the program faces a critical roadblock. A severe shortage of solar modules that meet Domestic Content Requirements (DCR) continues to hinder its progress and threaten the realization of its long-term objectives. The continuing module supply crunch is slowing down roo",
      "scores": {},
      "reason": "Not_Pipeline_Project",
      "timestamp": "2025-05-19T06:48:13.598171"
    },
    {
      "url": "https://mercomindia.com/mena-weekly-round-up-scatecs-1-gw-solar-project-in-egypt-secures-30-million",
      "title": "MENA Weekly Round-Up: Scatec’s 1 GW Solar Project in Egypt Secures $30 Million",
      "content_snippet": "The European Bank for Reconstruction and Development (EBRD) provided a $30 million equity bridge loan to Obelisk Solar Power , a special purpose vehicle owned by Scatec . The funds will be utilized to construct a 1 GW solar power project with a 200 MWh battery energy storage system in Nagaa Hammadi, Egypt. The facility is expected to be Egypt’s first hybrid renewable energy project. The project aims to assist Egypt’s transition to green energy and ensure grid stability. ERBD has invested more th",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T06:48:18.131236"
    },
    {
      "url": "https://mercomindia.com/china-overtakes-canada-to-regain-top-spot-among-li-ion-supply-chain-countries",
      "title": "China Overtakes Canada to Regain Top Spot Among Li-ion Supply Chain Countries",
      "content_snippet": "China has overtaken Canada to return as the leading Lithium-Ion (Li-ion) supply-chain country in 2024, according to BloombergNEF’s (BNEF) fifth edition of the Global Lithium-Ion Battery Supply Chain Ranking.\n\nThe rankings cover 30 countries’ capability to build a secure, reliable, and sustainable Li-ion supply chain.\n\nThe U.S. has moved one spot up to reach joint-second with Canada. India is in 14th position, progressing from 16th.\n\nChina\n\nChina had lost the first spot for the first time in the ",
      "scores": {
        "Solar": 0.0,
        "Battery": 2.0,
        "Wind": 0.0,
        "Hydro": 0.0,
        "GreenHydrogen": 0.0,
        "Biogas": 0.0,
        "Ethanol": 0.0
      },
      "reason": "Not_Renewable_Energy_Project",
      "timestamp": "2025-05-19T06:48:18.702205"
    },
    {
      "url": "https://mercomindia.com/canadian-solar-beats-revenue-expectations-q1",
      "title": "Canadian Solar Beats Revenue Expectations in Q1 Despite 10% YoY Drop",
      "content_snippet": "Solar module manufacturer Canadian Solar’s revenue for the first quarter (Q1) of 2025 dropped 10% year-over-year (YoY) to $1.19 billion, as module and battery energy storage system sales declined.\n\nHowever, the figure still surpassed analysts’ expectations by $100 million.\n\nThe company recorded an adjusted net loss of $59.87 million in Q1 2025, a reversal from the $12.35 million net income reported in Q1 2024. The adjusted loss per share came in at $1.07, falling short of analyst forecasts by $0",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T06:48:19.252256"
    },
    {
      "url": "https://mercomindia.com/recpdcl-invites-bids-for-transmission-system-augmentation-in-karnataka",
      "title": "RECPDCL Invites Bids for Transmission System Augmentation in Karnataka",
      "content_snippet": "REC Power Development and Consultancy (RECPDCL) has invited bids to establish an interstate transmission system (ISTS) in Davanagere and Chitradurga, Karnataka, to integrate renewable energy generation. The project will be executed on a build, own, operate, and transfer basis.\n\nBids must be submitted by July 18, 2025. Bids will be opened on the same day.\n\nThe Ministry of New and Renewable Energy has identified a renewable energy potential of 4 GW in Davanagere/ Chitradurga. The transmission syst",
      "scores": {},
      "reason": "Not_Pipeline_Project",
      "timestamp": "2025-05-19T06:48:20.065542"
    },
    {
      "url": "https://www.eqmagpro.com/hopewind-shined-at-intersolar-europe-2025-in-munich-eq/",
      "title": "Hopewind Shined at Intersolar Europe 2025 in Munich – EQ",
      "content_snippet": "Munich, Germany – Hopewind shined at Intersolar Europe 2025, held May 7–9 at the Munich International Exhibition Center. The company unveiled its comprehensive solar-storage-hydrogen solutions at Booth B4.239, reinforcing its commitment to accelerating the world’s transition to smart, sustainable energy systems.\n\nInnovation in Photovoltaics: Efficiency Meets Durability\n\nAs a BloombergNEF Tier 1 PV inverter manufacturer, Hopewind spotlighted its cutting-edge photovoltaic solutions, designed to me",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T08:06:48.595596"
    },
    {
      "url": "https://www.eqmagpro.com/hopewind-shined-at-intersolar-europe-2025-in-munich-eq/",
      "title": "Hopewind Shined at Intersolar Europe 2025 in Munich – EQ",
      "content_snippet": "Munich, Germany – Hopewind shined at Intersolar Europe 2025, held May 7–9 at the Munich International Exhibition Center. The company unveiled its comprehensive solar-storage-hydrogen solutions at Booth B4.239, reinforcing its commitment to accelerating the world’s transition to smart, sustainable energy systems.\n\nInnovation in Photovoltaics: Efficiency Meets Durability\n\nAs a BloombergNEF Tier 1 PV inverter manufacturer, Hopewind spotlighted its cutting-edge photovoltaic solutions, designed to me",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T08:06:48.927339"
    },
    {
      "url": "https://www.eqmagpro.com/union-minister-shri-manohar-to-participate-in-brics-energy-ministers-meeting-in-brazil-eq/",
      "title": "Union Minister Shri Manohar to participate in BRICS Energy Ministers meeting in Brazil – EQ",
      "content_snippet": "In Short : Union Minister Manohar Lal is in Brazil to attend the BRICS Energy Ministers’ Meeting, focusing on energy security and sustainability. He will showcase India’s progress, including a 90% increase in power capacity, leadership in renewable energy, and innovations in green technologies. The meeting emphasizes global cooperation for clean energy, highlighting India’s commitment to equitable access and sustainable practices.\n\nIn Detail : India to showcase its achievements over the past dec",
      "scores": {
        "Solar": 0.0,
        "Battery": 0.0,
        "Wind": 0.0,
        "Hydro": 1.0,
        "GreenHydrogen": 2.0,
        "Biogas": 0.0,
        "Ethanol": 1.0
      },
      "reason": "Not_Renewable_Energy_Project",
      "timestamp": "2025-05-19T08:06:50.674487"
    },
    {
      "url": "https://www.eqmagpro.com/union-minister-shri-manohar-to-participate-in-brics-energy-ministers-meeting-in-brazil-eq/",
      "title": "Union Minister Shri Manohar to participate in BRICS Energy Ministers meeting in Brazil – EQ",
      "content_snippet": "In Short : Union Minister Manohar Lal is in Brazil to attend the BRICS Energy Ministers’ Meeting, focusing on energy security and sustainability. He will showcase India’s progress, including a 90% increase in power capacity, leadership in renewable energy, and innovations in green technologies. The meeting emphasizes global cooperation for clean energy, highlighting India’s commitment to equitable access and sustainable practices.\n\nIn Detail : India to showcase its achievements over the past dec",
      "scores": {
        "Solar": 0.0,
        "Battery": 0.0,
        "Wind": 0.0,
        "Hydro": 1.0,
        "GreenHydrogen": 2.0,
        "Biogas": 0.0,
        "Ethanol": 1.0
      },
      "reason": "Not_Renewable_Energy_Project",
      "timestamp": "2025-05-19T08:06:50.819617"
    },
    {
      "url": "https://mercomindia.com/growth-in-renewables-pushed-jsw-energys-revenue-by-21-yoy-in-q4-fy25",
      "title": "Growth in Renewables Pushes JSW Energy’s Revenue Up 21% YoY in Q4 FY 2025",
      "content_snippet": "Independent power producer JSW Energy has reported a revenue of ₹34.97 billion (~$408.93 million) in the fourth quarter (Q4) of the financial year (FY) 2024-25, a 21% year-over-year (YoY) growth from ₹28.79 billion (~$336.66 million).\n\nThe company attributed this growth to increasing revenue from renewables. In Q4 FY25, its revenue from renewables rose 49.36% to ₹8.47 billion (~$99.04 million) from ₹5.67 billion (~$66.3 million) in the same quarter of the previous year.\n\nThe profit after tax (PA",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T08:07:13.930307"
    },
    {
      "url": "https://mercomindia.com/growth-in-renewables-pushed-jsw-energys-revenue-by-21-yoy-in-q4-fy25",
      "title": "Growth in Renewables Pushes JSW Energy’s Revenue Up 21% YoY in Q4 FY 2025",
      "content_snippet": "Independent power producer JSW Energy has reported a revenue of ₹34.97 billion (~$408.93 million) in the fourth quarter (Q4) of the financial year (FY) 2024-25, a 21% year-over-year (YoY) growth from ₹28.79 billion (~$336.66 million).\n\nThe company attributed this growth to increasing revenue from renewables. In Q4 FY25, its revenue from renewables rose 49.36% to ₹8.47 billion (~$99.04 million) from ₹5.67 billion (~$66.3 million) in the same quarter of the previous year.\n\nThe profit after tax (PA",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T08:07:14.044675"
    },
    {
      "url": "https://mercomindia.com/surana-solar-sell-stake-subsidiary-baidyanath-power",
      "title": "Surana Solar to Sell 49% Stake in Subsidiary to Baidyanath Power for ₹20 Million",
      "content_snippet": "Hyderabad-based solar module manufacturer Surana Solar has announced the divestment of 49% of its equity stake in Surana Technologies, a wholly owned subsidiary. Baidyanath Power, a third-party entity not belonging to the promoter or group companies associated with Surana Solar, will buy the equity stake for ₹20.36 million (~$238,036).\n\nThe transaction is expected to be completed by May 30, 2025, subject to customary closing conditions.\n\nSurana Technologies is implementing a 54 MW solar power pr",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T08:07:14.493396"
    },
    {
      "url": "https://mercomindia.com/surana-solar-sell-stake-subsidiary-baidyanath-power",
      "title": "Surana Solar to Sell 49% Stake in Subsidiary to Baidyanath Power for ₹20 Million",
      "content_snippet": "Hyderabad-based solar module manufacturer Surana Solar has announced the divestment of 49% of its equity stake in Surana Technologies, a wholly owned subsidiary. Baidyanath Power, a third-party entity not belonging to the promoter or group companies associated with Surana Solar, will buy the equity stake for ₹20.36 million (~$238,036).\n\nThe transaction is expected to be completed by May 30, 2025, subject to customary closing conditions.\n\nSurana Technologies is implementing a 54 MW solar power pr",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T08:07:14.597952"
    },
    {
      "url": "https://mercomindia.com/premier-energies-q4-revenue-up-48-yoy",
      "title": "Solar Module Manufacturer Premier Energies’ Q4 Revenue Up 48% YoY",
      "content_snippet": "Solar module and cell manufacturer Premier Energies reported a total income of ₹16.80 billion (~$196.55 million) in the fourth quarter (Q4) of the financial year (FY) 2025, a 48% year-over-year (YoY) increase from ₹11.38 billion (~$133.10 million).\n\nThe company’s quarterly earnings before interest, taxes, depreciation, and amortization (EBITDA) also rose 186% YoY to ₹5.28 billion (~$61.79 million) from ₹1.84 billion (~$21.52 million).\n\nNet profit was ₹2.77 billion (~$32.40 million), a 167% YoY i",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T08:07:15.062673"
    },
    {
      "url": "https://mercomindia.com/premier-energies-q4-revenue-up-48-yoy",
      "title": "Solar Module Manufacturer Premier Energies’ Q4 Revenue Up 48% YoY",
      "content_snippet": "Solar module and cell manufacturer Premier Energies reported a total income of ₹16.80 billion (~$196.55 million) in the fourth quarter (Q4) of the financial year (FY) 2025, a 48% year-over-year (YoY) increase from ₹11.38 billion (~$133.10 million).\n\nThe company’s quarterly earnings before interest, taxes, depreciation, and amortization (EBITDA) also rose 186% YoY to ₹5.28 billion (~$61.79 million) from ₹1.84 billion (~$21.52 million).\n\nNet profit was ₹2.77 billion (~$32.40 million), a 167% YoY i",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T08:07:15.189493"
    },
    {
      "url": "https://www.eqmagpro.com/prepare-electricity-plan-to-achieve-usd-1-trillion-economy-cm-revanth-reddy-eq/",
      "title": "Prepare Electricity Plan to achieve USD 1 trillion economy: CM Revanth Reddy – EQ",
      "content_snippet": "In Short : Telangana CM Revanth Reddy has directed officials to prepare a three-year electricity plan to support the state’s goal of becoming a $1 trillion economy. The plan focuses on modernizing power infrastructure, integrating renewable energy like floating solar, and installing solar panels along Hyderabad’s Outer Ring Road. Smart poles and underground networks will enhance efficiency and meet rising power demand sustainably.\n\nIn Detail : HYDERABAD: Chief Minister A Revanth Reddy has direct",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T09:28:59.849471"
    },
    {
      "url": "https://www.eqmagpro.com/prepare-electricity-plan-to-achieve-usd-1-trillion-economy-cm-revanth-reddy-eq/",
      "title": "Prepare Electricity Plan to achieve USD 1 trillion economy: CM Revanth Reddy – EQ",
      "content_snippet": "In Short : Telangana CM Revanth Reddy has directed officials to prepare a three-year electricity plan to support the state’s goal of becoming a $1 trillion economy. The plan focuses on modernizing power infrastructure, integrating renewable energy like floating solar, and installing solar panels along Hyderabad’s Outer Ring Road. Smart poles and underground networks will enhance efficiency and meet rising power demand sustainably.\n\nIn Detail : HYDERABAD: Chief Minister A Revanth Reddy has direct",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T09:29:00.429261"
    },
    {
      "url": "https://www.eqmagpro.com/andhra-to-witness-high-power-demand-till-november-chief-secretary-eq/",
      "title": "Andhra to witness high power demand till November Chief Secretary – EQ",
      "content_snippet": "In Short : Andhra Pradesh will face high power demand from June to November 2025, with daily consumption projected between 218 and 235 million units. Chief Secretary K. Vijayanand has directed DISCOMs to implement strategic measures like power swapping and maintain 24×7 control rooms. Enhanced monitoring and quick restoration plans are in place to manage outages during pre-monsoon thunderstorms and gusty winds.\n\nIn Detail : Amaravati – Andhra Pradesh Chief Secretary K Vijayanand on Saturday said",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T09:29:03.237269"
    },
    {
      "url": "https://www.eqmagpro.com/andhra-to-witness-high-power-demand-till-november-chief-secretary-eq/",
      "title": "Andhra to witness high power demand till November Chief Secretary – EQ",
      "content_snippet": "In Short : Andhra Pradesh will face high power demand from June to November 2025, with daily consumption projected between 218 and 235 million units. Chief Secretary K. Vijayanand has directed DISCOMs to implement strategic measures like power swapping and maintain 24×7 control rooms. Enhanced monitoring and quick restoration plans are in place to manage outages during pre-monsoon thunderstorms and gusty winds.\n\nIn Detail : Amaravati – Andhra Pradesh Chief Secretary K Vijayanand on Saturday said",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T09:29:03.621550"
    },
    {
      "url": "https://indianexpress.com/article/business/gold-rate-19-may-18-22-24-carat-gold-prices-chennai-mumbai-delhi-kolkata-10015060/",
      "title": "Gold Today Rate, 19 May: Check 18, 22 and 24 carat gold prices Chennai, Mumbai, Delhi, Kolkata and other cities",
      "content_snippet": "Gold Today Rate: Over the years, gold has proven to be an ideal inflation hedge. Gold has grown into an increasingly important investment in the minds of investors. The price of gold in India today is ₹9,551 per gram for 24 karat gold, ₹8,755 per gram for 22 karat gold and ₹7,163 per gram for 18 karat gold.\n\nGold Price in Delhi Today: 18 carat gold is priced at ₹7,176 per gram in Delhi today. Yesterday, it was available for ₹7,147 per gram in the market.\n\n22 carat gold is priced at ₹8,770 per gr",
      "scores": {},
      "reason": "Not_Pipeline_Project",
      "timestamp": "2025-05-19T09:29:10.199851"
    },
    {
      "url": "https://indianexpress.com/article/business/gold-rate-19-may-18-22-24-carat-gold-prices-chennai-mumbai-delhi-kolkata-10015060/",
      "title": "Gold Today Rate, 19 May: Check 18, 22 and 24 carat gold prices Chennai, Mumbai, Delhi, Kolkata and other cities",
      "content_snippet": "Gold Today Rate: Over the years, gold has proven to be an ideal inflation hedge. Gold has grown into an increasingly important investment in the minds of investors. The price of gold in India today is ₹9,551 per gram for 24 karat gold, ₹8,755 per gram for 22 karat gold and ₹7,163 per gram for 18 karat gold.\n\nGold Price in Delhi Today: 18 carat gold is priced at ₹7,176 per gram in Delhi today. Yesterday, it was available for ₹7,147 per gram in the market.\n\n22 carat gold is priced at ₹8,770 per gr",
      "scores": {},
      "reason": "Not_Pipeline_Project",
      "timestamp": "2025-05-19T09:29:10.446794"
    },
    {
      "url": "https://indianexpress.com/article/business/india-domestic-markets-sensex-nifty-it-stocks-10015055/",
      "title": "Markets decline in early trade dragged by IT stocks, weak Asian trends",
      "content_snippet": "Foreign Institutional Investors (FIIs) bought equities worth Rs 8,831.05 crore on Friday, according to exchange data. ( Express Photo )\n\nEquity Benchmark indices Sensex and Nifty declined in early trade on Monday dragged lower by IT stocks and a weak trend in Asian markets.\n\nThe 30-share BSE benchmark gauge Sensex declined 214.59 points to 82,116 in early trade.",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T09:29:10.728027"
    },
    {
      "url": "https://indianexpress.com/article/business/india-domestic-markets-sensex-nifty-it-stocks-10015055/",
      "title": "Markets decline in early trade dragged by IT stocks, weak Asian trends",
      "content_snippet": "Foreign Institutional Investors (FIIs) bought equities worth Rs 8,831.05 crore on Friday, according to exchange data. ( Express Photo )\n\nEquity Benchmark indices Sensex and Nifty declined in early trade on Monday dragged lower by IT stocks and a weak trend in Asian markets.\n\nThe 30-share BSE benchmark gauge Sensex declined 214.59 points to 82,116 in early trade.",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T09:29:10.887763"
    },
    {
      "url": "https://mercomindia.com/aptel-rules-ntpc-not-responsible-for-meter-sealing-in-solar-project",
      "title": "APTEL Rules NTPC Not Responsible for Meter Sealing in Solar Project",
      "content_snippet": "The Appellate Tribunal for Electricity (APTEL) has partially set aside a Central Electricity Regulatory Commission (CERC) order, clarifying that NTPC cannot be held responsible for sealing meters under solar power purchase agreements.\n\nIt ruled that this responsibility lies with the generating companies or transmission/distribution licensees.\n\nBackground\n\nUnder the National Solar Mission, the State Specific Bundling Scheme was launched to promote grid-connected solar power projects. The appellan",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T11:53:58.076487"
    },
    {
      "url": "https://mercomindia.com/pserc-approves-additional-surcharge-for-partial-and-full-open-access-power-consumers",
      "title": "PSERC Approves Additional Surcharge for Partial and Full Open Access Power Consumers",
      "content_snippet": "The Punjab State Electricity Regulatory Commission (PSERC) has accepted the Punjab State Power Corporation (PSPCL)’s request to approve an additional surcharge of ₹1.22 (~$0.014)/kWh for full open access consumers and ₹0.83 (~$0.009)/kWh for partial open access power consumers.\n\nThe additional surcharge will be levied on all consumers within the power supply area of PSPCL, provided the contracted capacity of the distribution company (DISCOM) remains stranded during the period.\n\nBackground\n\nThe p",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T11:53:59.348516"
    },
    {
      "url": "https://mercomindia.com/mnre-clarifies-net-billing-and-metering-provisions-under-almm",
      "title": "MNRE Clarifies Net Billing and Metering Provisions Under ALMM",
      "content_snippet": "The Ministry of New and Renewable Energy (MNRE) has clarified that net billing, and virtual and group net metering will also be treated on a par with net metering provisions under the Approved List of Models and Manufacturers (ALMM) List-II.\n\nList-II applies to solar cells which will be brought under the ambit of ALMM from June 2026. The inclusion of solar cells in ALMM addresses the growing domestic production capacity. Until now, only solar modules have been covered in the ALMM.\n\nThe Ministry ",
      "scores": {
        "Solar": 3.0,
        "Battery": 1.0,
        "Wind": 0.0,
        "Hydro": 0.0,
        "GreenHydrogen": 0.0,
        "Biogas": 0.0,
        "Ethanol": 0.0
      },
      "reason": "Not_Renewable_Energy_Project",
      "timestamp": "2025-05-19T11:53:59.918696"
    },
    {
      "url": "https://www.energy-storage.news/solving-energy-storages-key-challenges-with-goldwinds-grid-forming-dc-and-ac-solutions/",
      "title": "Solving energy storage industry's key challenges with Goldwind",
      "content_snippet": "Goldwind discusses how its unmatched system-level expertise from the renewables space makes it ideally placed to solve the key industry challenges it sees emerging in energy storage.\nSpeaking to Energy-Storage.news at ees Europe in Germany a fortnight ago, Beijing-headquartered Goldwind Carbon Neutral chairman Yantian (Tony) Pan discussed the company’s background in wind, and how that enables it to bridge the technical and commercial gaps in the storage industry today.\nEnjoy 12 months of exclusi",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T11:54:51.022022"
    },
    {
      "url": "https://www.energy-storage.news/elements-green-receives-gps-approval-for-1-3gwh-solar-plus-storage-site-in-queensland-australia/",
      "title": "Elements Green receives GPS approval for 1.3GWh solar-plus-storage site in Queensland, Australia",
      "content_snippet": "Elements Green claims this is Australia’s largest solar and battery energy storage project to have received Generator Performance Standard (GPS) approval. It will couple 696MWp of solar PV generation with a 666MW/1,332MWh battery energy storage system (BESS).\n\nThe hybrid facility will be located within the proposed Central Queensland renewable energy zone (REZ), approximately 50km southeast of Gladstone. Queensland is set to pursue the development of 12 REZ across the state to support the deploy",
      "scores": {},
      "reason": "Not_India_Project",
      "timestamp": "2025-05-19T11:54:51.616206"
    },
    {
      "url": "https://mercomindia.com/solar-systems-reduce-power-costs-at-ramakrishna-yogashrama-in-bengaluru",
      "title": "Solar Systems Reduce Power Costs at Ramakrishna Yogashrama in Bengaluru",
      "content_snippet": "Religious institutions across India are increasingly adopting solar power to meet their energy needs sustainably. For many ashrams, temples, and monasteries—often located in remote or semi-urban areas with unreliable grid access—solar energy provides a practical, eco-friendly, and cost-effective alternative.\n\nRamakrishna Yogashrama, a spiritual and academic center located in Bengaluru’s outskirts, has successfully implemented a multi-faceted solar energy strategy to overcome chronic power outage",
      "scores": {},
      "reason": "Not_Pipeline_Project",
      "timestamp": "2025-05-19T12:41:21.275455"
    }
  ],
  "last_updated": "2025-05-19T12:41:21.275670"
}